/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ms_tolower.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tjung <tjung@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/03/02 16:20:48 by minsunki          #+#    #+#             */
/*   Updated: 2022/03/03 12:29:09 by tjung            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "minishell.h"

// char	*ms_tolower(char *str)
// 전달받은 str을 모두 소문자로 변경

char	*ms_tolower(char *str)
{
	while (*str)
		*str = ft_tolower(*str);
}
